In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
obj = Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = Series([4,7,-5,3], index=['a','b','d','c'])
obj2

a    4
b    7
d   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['a', 'b', 'd', 'c'], dtype='object')

In [10]:
obj2['a']

4

In [12]:
obj2['d']

-5

In [13]:
obj2[['a','d','c']]

a    4
d   -5
c    3
dtype: int64

In [14]:
obj2

a    4
b    7
d   -5
c    3
dtype: int64

In [16]:
obj2[obj2>0]

a    4
b    7
c    3
dtype: int64

In [21]:
obj2*2

a     8
b    14
d   -10
c     6
dtype: int64

In [20]:
import numpy as np
np.exp(obj2)

a      54.598150
b    1096.633158
d       0.006738
c      20.085537
dtype: float64

In [23]:
'b' in obj2

True

In [24]:
'e' in obj2

False

In [35]:
sdata = {"Ohio":111,"NY":112,"NJ":113,"UT":400}
obj3 = Series(sdata)
obj3

Ohio    111
NY      112
NJ      113
UT      400
dtype: int64

In [36]:
states = ["Cali","Ohio","NY","NJ"]
obj4 = Series(sdata, index=states)
obj4

Cali      NaN
Ohio    111.0
NY      112.0
NJ      113.0
dtype: float64

In [31]:
obj4[pd.notnull(obj4)]

Ohio    111.0
NY      112.0
NJ      113.0
dtype: float64

In [32]:
obj4[pd.isnull(obj4)]

Cali   NaN
dtype: float64

In [33]:
obj3

Ohio    111
NY      112
NJ      113
dtype: int64

In [34]:
obj4

Cali      NaN
Ohio    111.0
NY      112.0
NJ      113.0
dtype: float64

In [37]:
obj3+obj4

Cali      NaN
NJ      226.0
NY      224.0
Ohio    222.0
UT        NaN
dtype: float64

In [38]:
obj4.name = "Population"
obj4.index.name = "State"
obj4

State
Cali      NaN
Ohio    111.0
NY      112.0
NJ      113.0
Name: Population, dtype: float64

In [40]:
obj.index = ["alpha","Bravo","Charlie","Delta"]

In [41]:
obj

alpha      4
Bravo      7
Charlie   -5
Delta      3
dtype: int64

In [45]:
data = {"state":['OH','OH','OH','NV','NV'],
       "pop":[1,1.1,1.3,4,5],
       "year":[2000,2001,2002,2001,2000]}
frame = DataFrame(data)

In [46]:
frame

  state  pop  year
0    OH  1.0  2000
1    OH  1.1  2001
2    OH  1.3  2002
3    NV  4.0  2001
4    NV  5.0  2000

In [47]:
DataFrame(data, columns=["year","state","pop"])

   year state  pop
0  2000    OH  1.0
1  2001    OH  1.1
2  2002    OH  1.3
3  2001    NV  4.0
4  2000    NV  5.0

In [48]:
data

{'state': ['OH', 'OH', 'OH', 'NV', 'NV'],
 'pop': [1, 1.1, 1.3, 4, 5],
 'year': [2000, 2001, 2002, 2001, 2000]}

In [219]:
frame2 = DataFrame(data, columns=["year","state","debt","pop"],index =["one","two","three","four","five"])

In [50]:
frame2

       year state debt  pop
one    2000    OH  NaN  1.0
two    2001    OH  NaN  1.1
three  2002    OH  NaN  1.3
four   2001    NV  NaN  4.0
five   2000    NV  NaN  5.0

In [52]:
frame2.columns

Index(['year', 'state', 'debt', 'pop'], dtype='object')

In [56]:
frame2['year']
frame2.state

one      OH
two      OH
three    OH
four     NV
five     NV
Name: state, dtype: object

In [62]:
frame2

       year state debt  pop
one    2000    OH  NaN  1.0
two    2001    OH  NaN  1.1
three  2002    OH  NaN  1.3
four   2001    NV  NaN  4.0
five   2000    NV  NaN  5.0

In [83]:
frame2.loc[['three','four']]

       year state debt  pop
three  2002    OH  NaN  1.3
four   2001    NV  NaN  4.0

In [63]:
frame2.iloc[0]
#access row using number position of index

year     2000
state      OH
debt      NaN
pop         1
Name: one, dtype: object

In [73]:
frame2.iloc[:,:]

       year state debt  pop
one    2000    OH  NaN  1.0
two    2001    OH  NaN  1.1
three  2002    OH  NaN  1.3
four   2001    NV  NaN  4.0
five   2000    NV  NaN  5.0

In [86]:
frame2['debt'] = 6.5

In [87]:
frame2

       year state  debt  pop
one    2000    OH   6.5  1.0
two    2001    OH   6.5  1.1
three  2002    OH   6.5  1.3
four   2001    NV   6.5  4.0
five   2000    NV   6.5  5.0

In [89]:
frame2.debt = np.arange(5,)

In [90]:
frame2

       year state  debt  pop
one    2000    OH     0  1.0
two    2001    OH     1  1.1
three  2002    OH     2  1.3
four   2001    NV     3  4.0
five   2000    NV     4  5.0

In [95]:
len(frame2)

5

In [96]:
frame2.shape

(5, 4)

In [97]:
val = Series([-1.2,-1.5,-1.7],index=["two","three","five"])
val

two     -1.2
three   -1.5
five    -1.7
dtype: float64

In [99]:
frame2.debt = val

In [100]:
frame2

       year state  debt  pop
one    2000    OH   NaN  1.0
two    2001    OH  -1.2  1.1
three  2002    OH  -1.5  1.3
four   2001    NV   NaN  4.0
five   2000    NV  -1.7  5.0

In [173]:
frame2['eastern'] = frame2.state == "OH"
frame2

Features  year state  debt  pop   D  eastern
S.no
one       2000    OH   NaN  1.0 NaN     True
two       2001    OH  -1.2  1.1 NaN     True
three     2002    OH  -1.5  1.3 NaN     True
four      2001    NV   NaN  4.0 NaN    False
five      2000    NV  -1.7  5.0 NaN    False

In [174]:
del frame2['eastern']

In [175]:
frame2.columns

Index(['year', 'state', 'debt', 'pop', 'D'], dtype='object', name='Features')

In [111]:
frame2["C"] = ""
frame2["D"] = np.nan
frame2

       year state  debt  pop C   D
one    2000    OH   NaN  1.0   NaN
two    2001    OH  -1.2  1.1   NaN
three  2002    OH  -1.5  1.3   NaN
four   2001    NV   NaN  4.0   NaN
five   2000    NV  -1.7  5.0   NaN

In [112]:
frame2.columns

Index(['year', 'state', 'debt', 'pop', 'C', 'D'], dtype='object')

In [113]:
del frame2['C']

In [119]:
frame2['D'][:]

one     NaN
two     NaN
three   NaN
four    NaN
five    NaN
Name: D, dtype: float64

In [121]:
np.nan

nan

In [127]:
if any(frame2["D"]) != np.nan:
    print(">")

>

In [ ]:
del [frame2['D'] if

In [126]:
any?

In [130]:
if frame2['D'][1] != np.nan:
    print(">")

>

In [131]:
np.nan == np.nan

False

In [137]:
a = frame2['pop'].copy()

In [140]:
a[:] = 1

In [141]:
a

one      1.0
two      1.0
three    1.0
four     1.0
five     1.0
Name: pop, dtype: float64

In [142]:
frame2

       year state  debt  pop   D
one    2000    OH   NaN  1.0 NaN
two    2001    OH  -1.2  1.1 NaN
three  2002    OH  -1.5  1.3 NaN
four   2001    NV   NaN  4.0 NaN
five   2000    NV  -1.7  5.0 NaN

In [146]:
frame2.T['one']

year     2000
state      OH
debt      NaN
pop         1
D         NaN
Name: one, dtype: object

In [147]:
frame2.T.loc["year"]

one      2000
two      2001
three    2002
four     2001
five     2000
Name: year, dtype: object

In [156]:
frame2['year'][-1:0:-1]

five     2000
four     2001
three    2002
two      2001
Name: year, dtype: int64

In [157]:
frame2.values

array([[2000, 'OH', nan, 1.0, nan],
       [2001, 'OH', -1.2, 1.1, nan],
       [2002, 'OH', -1.5, 1.3, nan],
       [2001, 'NV', nan, 4.0, nan],
       [2000, 'NV', -1.7, 5.0, nan]], dtype=object)

In [165]:
frame2.isna()

        year  state   debt    pop     D
one    False  False   True  False  True
two    False  False  False  False  True
three  False  False  False  False  True
four   False  False   True  False  True
five   False  False  False  False  True

In [164]:
frame2['year'].notna()

one      True
two      True
three    True
four     True
five     True
Name: year, dtype: bool

In [167]:
frame2.index.name = "S.no"

In [169]:
frame2.columns.name="Features"

In [170]:
frame2

Features  year state  debt  pop   D
S.no
one       2000    OH   NaN  1.0 NaN
two       2001    OH  -1.2  1.1 NaN
three     2002    OH  -1.5  1.3 NaN
four      2001    NV   NaN  4.0 NaN
five      2000    NV  -1.7  5.0 NaN

In [171]:
frame2.values

array([[2000, 'OH', nan, 1.0, nan],
       [2001, 'OH', -1.2, 1.1, nan],
       [2002, 'OH', -1.5, 1.3, nan],
       [2001, 'NV', nan, 4.0, nan],
       [2000, 'NV', -1.7, 5.0, nan]], dtype=object)

In [178]:
frame2.index = ["alpha","Bravo","Charlie","Delta","Erin"]

In [179]:
frame2

Features  year state  debt  pop   D
alpha     2000    OH   NaN  1.0 NaN
Bravo     2001    OH  -1.2  1.1 NaN
Charlie   2002    OH  -1.5  1.3 NaN
Delta     2001    NV   NaN  4.0 NaN
Erin      2000    NV  -1.7  5.0 NaN

In [189]:
frame2.index = np.arange(1,6)

In [182]:
frame2

Features  year state  debt  pop   D
1         2000    OH   NaN  1.0 NaN
2         2001    OH  -1.2  1.1 NaN
3         2002    OH  -1.5  1.3 NaN
4         2001    NV   NaN  4.0 NaN
5         2000    NV  -1.7  5.0 NaN

In [184]:
index = frame2.index

In [186]:
frame2.index is index

True

In [192]:
frame2.index = frame2.year

In [220]:
frame2

       year state debt  pop
one    2000    OH  NaN  1.0
two    2001    OH  NaN  1.1
three  2002    OH  NaN  1.3
four   2001    NV  NaN  4.0
five   2000    NV  NaN  5.0

In [221]:
frame2.index.drop(frame2.index,errors='ignore')

Index([], dtype='object')

In [206]:
frame2.index = np.arange(len(frame2))

In [210]:
frame2.index = ['a','b','c','d','e']

In [222]:
frame2

       year state debt  pop
one    2000    OH  NaN  1.0
two    2001    OH  NaN  1.1
three  2002    OH  NaN  1.3
four   2001    NV  NaN  4.0
five   2000    NV  NaN  5.0

In [224]:
frame2.index.drop('one')

Index(['two', 'three', 'four', 'five'], dtype='object')

In [226]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [227]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [228]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [229]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [230]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [231]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [232]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [233]:
obj3.reindex(range(6), method='ffill')
#ffill which forward fills the values:

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [234]:
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [255]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [236]:
frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [237]:
frame.reindex(['1','2','3','4'])

   Ohio  Texas  California
1   NaN    NaN         NaN
2   NaN    NaN         NaN
3   NaN    NaN         NaN
4   NaN    NaN         NaN

In [238]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [252]:
#columns can be reindexed using the columns keyword: 
states = ['Texas', 'Utah', 'California','Ohio']
frame.reindex(columns=states)
#frame

   Texas  Utah  California  Ohio
a      1   NaN           2     0
c      4   NaN           5     3
d      7   NaN           8     6

In [251]:
#Both can be reindexed in one shot, though interpolation will only apply row-wise (axis 0):
print(frame.reindex(['a','b','c','d'],columns=states))
print(frame.reindex(['a','b','c','d'],columns=states,fill_value=0))

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0
   Texas  Utah  California
a      1     0           2
b      0     0           0
c      4     0           5
d      7     0           8

In [270]:
frame.loc[['a','b','c','d'],states]

/Users/karanmaheshwari/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California  Ohio
a    1.0   NaN         2.0   0.0
b    NaN   NaN         NaN   NaN
c    4.0   NaN         5.0   3.0
d    7.0   NaN         8.0   6.0

In [278]:
frame.reindex(index=['a','b','c','d'],columns=states.sort(),method='ffill')

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [291]:
frame.reindex(index=['a','b','c','d'],columns=states)

   California  Ohio  Texas  Utah
a         2.0   0.0    1.0   NaN
b         NaN   NaN    NaN   NaN
c         5.0   3.0    4.0   NaN
d         8.0   6.0    7.0   NaN

In [292]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [294]:
newobj = obj.drop('c')

In [298]:
newobj[newobj>2].index

Index(['d', 'e'], dtype='object')

In [299]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [300]:
obj = obj.drop(newobj[newobj>2].index)
obj

a    0.0
b    1.0
c    2.0
dtype: float64

In [353]:
data = DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [307]:
data[data['one']>4].index

Index(['Utah', 'New York'], dtype='object')

In [308]:
data.drop(data[data['one']>4].index)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [310]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [321]:
data.loc[:][['one','two']]>4

            one    two
Ohio      False  False
Colorado  False   True
Utah       True   True
New York   True   True

In [347]:
print(data[data.loc[:]>4].fillna(value=-1))
data[data.loc[:]>4].fillna(value=-1)['three'][0]

           one   two  three  four
Ohio      -1.0  -1.0   -1.0  -1.0
Colorado  -1.0   5.0    6.0   7.0
Utah       8.0   9.0   10.0  11.0
New York  12.0  13.0   14.0  15.0

-1.0

In [334]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [341]:
data.drop(['one','two'],axis=1)['three'][1]
#[column][row]

6

In [356]:
# indexing into dataframe is retrieving one or more column either with single value or sequence

In [357]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int64

In [358]:
data[['one','two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [364]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [365]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [368]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [393]:
data.loc['Colorado',['two','three']][1]

6

In [403]:
print(data.loc[['Ohio','Colorado'],'two'])
print(data.loc[['Ohio','Colorado'],['two','three']])
print(data.loc[['Ohio','Colorado'],['two','three']][1:]['three'])

Ohio        0
Colorado    5
Name: two, dtype: int64
          two  three
Ohio        0      0
Colorado    5      6
Colorado    6
Name: three, dtype: int64

In [405]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [406]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [414]:
data.loc[data['three']>5]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [419]:
data.loc[data['three']==0].index

Index(['Ohio'], dtype='object')

obj[val] Select single column or sequence of columns from the DataFrame. Special case con- veniences: boolean array (filter rows), slice (slice rows), or boolean DataFrame (set values based on some criterion).


obj.loc[val]
obj.loc[:, val] obj.loc[val1, val2]
reindex method

In [433]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [434]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [435]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [437]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [436]:
df1.add(df2, fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [426]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd')) 
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [427]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [428]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [429]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [430]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [438]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print(frame)
series = frame.iloc[0]
print(series)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0
b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [439]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [446]:
series2 = Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [445]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN